EA/src/InformationRegisters/ПолученныеСообщенияОбменовДанными.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>ПолученныеСообщенияОбменовДанными</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НомерСообщения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбновитьНомерВУзлеПослеЗагрузки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерПоследнегоСообщенияПринятогоУзлом</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяФайлаСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХранилищеСообщения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Загружено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидТранспортаОбмена</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТранспортаСообщенийОбмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПолучения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РезультатыВыполненияОбмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СообщенияРезультата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>УзелИнформационнойБазы</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВнеОчередиСообщений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

EA/src/InformationRegisters/ПолученныеСообщенияОбменовДанными/Ext/ManagerModule.bsl
// Функция - Получить следующее сообщение для загрузки
//     Возвращает следующее сообщение, требующее загрузки
//
// Параметры:
//  УзелИнформационнойБазы	 - ПланыОбменаСсылка - ссылка узла плана обмена
// 
// Возвращаемое значение:
//   - Структура,Неопределено - Неопределено, если нет сообщений для загрузки,
//                              если есть сообщение, требующее загрузки, то возвращается Структура с описанием сообщения
//
Функция ПолучитьСледующееСообщениеДляЗагрузки( УзелИнформационнойБазы ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр( "УзелИнформационнойБазы", УзелИнформационнойБазы );
	
	// сначала поищем наличие сообщений вне очереди
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПолученныеСообщенияОбменовДаннымиСрезПервых.*
	|ИЗ
	|	РегистрСведений.ПолученныеСообщенияОбменовДанными.СрезПервых(
	|			,
	|			ВнеОчередиСообщений = ИСТИНА
	|				И УзелИнформационнойБазы = &УзелИнформационнойБазы
	|				И Загружено = ЛОЖЬ) КАК ПолученныеСообщенияОбменовДаннымиСрезПервых";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Возврат ОбщегоНазначения.РезультатЗапросаВСтруктуру( РезультатЗапроса );
	КонецЕсли;
	
	// если нет сообщений вне очереди, то попытаемся выбрать следующее сообщение в очереди
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПолученныеСообщенияОбменовДаннымиСрезПоследних.*
	|ИЗ
	|	РегистрСведений.ПолученныеСообщенияОбменовДанными.СрезПоследних(
	|			,
	|			ВнеОчередиСообщений = ЛОЖЬ
	|				И УзелИнформационнойБазы = &УзелИнформационнойБазы) КАК ПолученныеСообщенияОбменовДаннымиСрезПоследних
	|ГДЕ
	|	ПолученныеСообщенияОбменовДаннымиСрезПоследних.Загружено = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Возврат ОбщегоНазначения.РезультатЗапросаВСтруктуру( РезультатЗапроса );
	КонецЕсли;
	
	// если сообщений нет, то возвращаем Неопределено
	Возврат Неопределено;
	
КонецФункции

// Процедура - Обновить добавить запись
//      Обновляет или добавляет запись в регстр
//
// Параметры:
//  СтруктураЗначенийЗаписи	 - Структура - структура, содержащая значения записи, обязательно должна содержать значения всех измерений
//
Процедура ОбновитьДобавитьЗапись( СтруктураЗначенийЗаписи ) Экспорт
	
	НаборЗаписей = РегистрыСведений.ПолученныеСообщенияОбменовДанными.СоздатьНаборЗаписей();
	
	Для Каждого Отбор Из НаборЗаписей.Отбор Цикл
		Отбор.Установить( СтруктураЗначенийЗаписи[ Отбор.Имя ] );
	КонецЦикла;
	
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		Запись = НаборЗаписей.Добавить();
	Иначе
		Запись = НаборЗаписей[0];
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств( Запись, СтруктураЗначенийЗаписи );
	
	НаборЗаписей.Записать( Истина );
	
КонецПроцедуры
